Revit 2024 API
DXFExportOptions Constructor (DXFExportOptions)
 Constructs a new instance of DXFImportOptions as a copy of the export options.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public DXFExportOptions(
	DXFExportOptions option
)
Visual Basic
Public Sub New ( _
	option As DXFExportOptions _
)
Visual C++
public:
DXFExportOptions(
	DXFExportOptions^ option
)
Parameters
option
Type: Autodesk.Revit.DB.DXFExportOptions
 The options to be copied.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
DXFExportOptions Class
DXFExportOptions Overload
Autodesk.Revit.DB Namespace